{
    "texts": [
    { 
     "document_id": "1", 
     "text": "This book will perhaps only be understood by those\\nwho have themselves\\nalready\\nthought the thoughts which\\nare expressed in it---or similar thoughts. It is\\ntherefore\\nnot a text-book. Its object would be attained if there\\nwere one person who read it with understanding and to\\nwhom it afforded pleasure.\\nThe book deals with the problems of philosophy and\\nshows, as I believe, that the method of formulating these\\nproblems rests on the misunderstanding of the logic of\\nour language. Its whole meaning could be summed up\\nsomewhat as follows: What can be said at all can be said\\nclearly; and whereof one cannot speak thereof one must\\nbe silent.\\nThe book will,\\n, draw a limit to thinking,\\nor rather---not to thinking, but to the expression of\\nthoughts; for, in order to draw a limit to thinking we\\nshould have to be able to think both sides of this limit\\n(we should therefore have to be able to think what cannot\\nbe thought).\\nThe limit can, therefore, only be drawn in language\\nand what lies on the other side of the limit will be simply\\nnonsense.\\nHow far my efforts agree with those of other philosophers\\nI will not decide. Indeed what I have here\\nwritten makes no claim to novelty in points of detail;\\nand therefore I give no sources, because it is indifferent\\nto me whether what I have thought has already been\\nthought before me by another.\\nI will only mention that to the great works of Frege\\nand the writings of my friend Bertrand Russell I owe in\\nlarge measure the stimulation of my thoughts.\\nIf this work has a value it consists in two things.\\nFirst that in it thoughts are expressed, and this value will\\nbe the greater the better the thoughts are expressed. The\\nmore the nail has been hit on the head. Here I am\\nconscious that I have fallen far short of the possible.\\nSimply because my powers are insufficient to cope with\\nthe task. May others come and do it better.\\nOn the other hand the truth of the thoughts communicated\\nhere seems to me unassailable and definitive. Iam, therefore, of the opinion that the problems have inessentials been finally solved. And if I am not mistaken\\nin this, then the value of this work secondly consists in the\\nfact that it shows how little has been done when these\\nproblems have been solved."
    }]
}
    